Repository: DanilKorotaev/knowledge-base-app-ios
Catalog: SharedLocalization/Localizable.xcstrings
Source language: en
Languages: ru

# assistant.processing
source: Processing…
ru: Обработка…

# assistant.processing_a11y
source: Processing reply
ru: Обработка ответа

# composer.add_content
source: Add text, a file, or a voice note.
ru: Добавьте текст, файл или голосовое.

# composer.voice_transcription_failed
source: Could not transcribe the voice note.
ru: Голосовое сообщение не удалось расшифровать.

# chat.retry
source: Retry
ru: Повторить

# chat.copy_all
source: Copy all
ru: Скопировать всё

# chat.copy_done
source: Copied
ru: Скопировано

# chat.open_to_copy
source: Open to copy
ru: Открыть для копирования

# chat.copy_sheet_title
source: Message
ru: Сообщение

# chat.copy_sheet_done
source: Done
ru: Готово

# error.api_not_configured
source: API is not configured.
ru: API не настроен.

# error.connection_lost
source: Connection lost.
ru: Соединение потеряно.

# error.invalid_server_response
source: Invalid server response.
ru: Неверный ответ сервера.

# error.network_generic
source: Network error.
ru: Ошибка сети.

# error.network_not_allowed
source: Network not available for this app.
ru: Сеть недоступна для приложения.

# error.no_internet
source: No internet connection.
ru: Нет подключения к интернету.

# error.send_failed
source: Could not send the message.
ru: Не удалось отправить сообщение.

# error.send_failed_format
source: Could not send: %@
ru: Не удалось отправить: %@

# error.server_format
source: Server error (%lld).
ru: Ошибка сервера (%lld).

# error.server_timeout_format
source: Server timeout (%lld).
ru: Таймаут сервера (%lld).

# error.server_unavailable
source: Server unavailable.
ru: Сервер недоступен.

# error.speech_not_recognized
source: Speech was not recognized in the recording.
ru: Речь в записи не распознана.

# error.timeout
source: Timed out.
ru: Таймаут.

# error.unknown
source: Unknown error.
ru: Неизвестная ошибка.

# intent.quick_record.description
source: Open Knowledge Base for a voice request
ru: Открыть Knowledge Base для голосового запроса

# intent.quick_record.title
source: Quick record
ru: Быстрая запись

# network.no_connection
source: No network connection
ru: Нет подключения к сети

# tab.health
source: Health
ru: Здоровье

# tab.chats
source: Chats
ru: Чаты

# tab.settings
source: Settings
ru: Настройки

# settings.language
source: Language
ru: Язык

# settings.about
source: About
ru: О приложении

# settings.about.version
source: Version
ru: Версия

# settings.about.copy_hint
source: Tap the version to copy it for support.
ru: Нажмите на версию, чтобы скопировать её для поддержки.

# settings.about.copied
source: Copied to clipboard.
ru: Скопировано в буфер обмена.

# settings.language.russian
source: Russian
ru: Русский

# settings.language.system
source: System default
ru: Как в системе

# shortcut.voice_short_title
source: Voice KB
ru: Голос KB

# sync.failed_data_format
source: %1$@ · data from %2$@
ru: %1$@ · данные от %2$@

# sync.failed_default
source: Update failed
ru: Не удалось обновить

# sync.offline
source: Offline
ru: Офлайн

# sync.offline_data_format
source: Offline · data from %@
ru: Офлайн · данные от %@

# sync.updated_format
source: Updated %@
ru: Обновлено %@

# sync.updating
source: Updating…
ru: Обновление…

# voice.delete
source: Delete
ru: Удалить

# voice.message_placeholder
source: Message text
ru: Текст сообщения

source: Voice note
ru: Голосовое

source: Voice not recognized
ru: Голосовое не распознано

# voice.retry
source: Retry
ru: Повторить

# voice.review_create_chat_first
source: Create a chat first, then send.
ru: Сначала создайте чат, затем отправьте сообщение.

# voice.review_edit_and_send
source: Edit the text and tap Send to chat.
ru: Отредактируйте текст и нажмите «Отправить в чат».

# voice.review_section
source: Review
ru: Проверка

# voice.review_send_to_format
source: Will send to "%@". You can edit the text.
ru: Отправится в «%@». Можно отредактировать текст вручную.

# voice.send_to_chat
source: Send to chat
ru: Отправить в чат

# voice.title
source: Voice note
ru: Голосовое

# voice.transcribing
source: Transcribing…
ru: Распознаём речь…

# watch_widget.record.description
source: Open the app and start voice recording.
ru: Открыть приложение и начать голосовую запись.

# watch_widget.record.title
source: Record
ru: Запись

# widget.current_session.description
source: Session shortcut and quick access to recording.
ru: Ярлык сессии и быстрый доступ к записи.

# widget.current_session.title
source: Current session
ru: Текущая сессия

# widget.quick_record.description
source: Open the app for a voice request (App Intent + URL).
ru: Открыть приложение для голосового запроса (App Intent + URL).

# widget.quick_record.title
source: Quick record
ru: Быстрая запись

# widget.record_button
source: Record
ru: Запись

# common.cancel
source: Cancel
ru: Отмена

# health.error.missing_entitlement
source: This build is missing the HealthKit entitlement. Install a newer TestFlight build after the CI fix.
ru: В этой сборке нет HealthKit entitlement. Установите более новую сборку из TestFlight после исправления CI.

# health.error.authorization_required
source: Allow Health access in Settings → Health, then try again.
ru: Разрешите доступ к Health в настройках вкладки, затем повторите.

# health.authorization.prompt
source: Grant read access to show today’s summary and sync data.
ru: Разрешите чтение данных Health, чтобы показать сводку за сегодня и синхронизировать.

# health.sync.no_preview
source: No data for today yet.
ru: Данных за сегодня пока нет.

# health.error.unavailable
source: Health data is not available on this device.
ru: Данные Health недоступны на этом устройстве.

# health.loading_preview
source: Loading today…
ru: Загрузка данных за сегодня…

# health.request_access
source: Allow Health access
ru: Разрешить доступ к Health

# health.section.today
source: Today
ru: Сегодня

# health.section.sync
source: Sync
ru: Синхронизация

# health.section.error
source: Error
ru: Ошибка

# health.sync.now
source: Sync now
ru: Синхронизировать

# health.sync.running
source: Syncing…
ru: Синхронизация…

# health.sync.no_state
source: No sync state yet — run your first sync.
ru: Состояние синхронизации пока пустое — запустите первую синхронизацию.

# health.sync.backfill_cursor
source: Backfill cursor
ru: Курсор backfill

# health.sync.history_through
source: History exported through
ru: История выгружена до

# health.sync.history_remaining
source: Days of history left
ru: Осталось дней истории

# health.sync.backfill_hint
source: Tap Sync again to export older daily summaries (~30 days per run). Workouts are already fully synced.
ru: Нажмите Sync ещё раз, чтобы выгрузить более старые дневные сводки (~30 дней за раз). Тренировки уже выгружены полностью.

# health.sync.last_success %@
source: Last sync: %@
ru: Последняя синхронизация: %@

# health.sync.stage.starting
source: Preparing sync…
ru: Подготовка синхронизации…

# health.sync.stage.workouts
source: Exporting workouts from Health…
ru: Экспорт тренировок из Health…

# health.sync.stage.daily
source: Exporting today’s summary…
ru: Экспорт сводки за сегодня…

# health.sync.stage.backfill
source: Exporting older daily summaries…
ru: Экспорт более старых дневных сводок…

# health.sync.stage.uploading %lld
source: Uploading files (%1$lld so far)…
ru: Загрузка файлов (уже %1$lld)…

# health.sync.stage.uploading_progress %lld %lld %lld
source: Uploading files %1$lld of %2$lld (%3$lld%%)…
ru: Загрузка файлов %1$lld из %2$lld (%3$lld%%)…

# health.sync.stage.workouts_count %lld
source: Preparing workouts (%1$lld found)…
ru: Подготовка тренировок (найдено %1$lld)…

# health.sync.stage.finishing
source: Finishing sync…
ru: Завершение синхронизации…

# health.section.workouts
source: Workouts
ru: Тренировки

# health.section.daily
source: Daily summaries
ru: Дневные сводки

# health.section.quick_sync
source: Quick sync
ru: Быстрая синхронизация

# health.section.history
source: Daily history
ru: История по дням

# health.section.archive
source: Export archive
ru: Экспорт архива

# health.sync.recent
source: Sync recent data
ru: Синхронизировать недавние данные

# health.sync.recent_footer
source: Uploads new/changed workouts and today’s daily summary. Does not export older days.
ru: Загружает новые/изменённые тренировки и сводку за сегодня. Старые дни не выгружает.

# health.workouts.status
source: Server status
ru: Статус на сервере

# health.workouts.status.synced
source: Up to date
ru: Актуально

# health.workouts.status.pending
source: Needs sync
ru: Нужна синхронизация

# health.workouts.last_sync
source: Last sync
ru: Последняя синхронизация

# health.workouts.footer
source: Each workout is stored as a separate JSON file with type, calories, and heart rate.
ru: Каждая тренировка — отдельный JSON с типом, калориями и пульсом.

# health.daily.status.none
source: No daily history exported yet
ru: Дневная история ещё не выгружалась

# health.daily.footer
source: Daily files contain steps, sleep, and calories per calendar day. Use Daily history to export a date range.
ru: Daily-файлы — шаги, сон и калории за каждый день. Для выгрузки периода используйте «История по дням».

# health.history.from
source: From
ru: С

# health.history.to
source: To
ru: По

# health.history.sync_button
source: Upload selected period
ru: Выгрузить выбранный период

# health.history.footer
source: Uploads one daily JSON per day in the selected range. Keep the app open (screen may lock); force-quitting stops the upload. Enable “Re-export all days” after schema updates. Live Activity progress is planned next.
ru: Загружает по одному daily JSON на каждый день периода. Держите приложение открытым (экран можно погасить); принудительное закрытие останавливает выгрузку. «Перезаписать все дни» — после обновления схемы. Live Activity с прогрессом — в следующем шаге.

# health.history.reexport_all
source: Re-export all days in range
ru: Перезаписать все дни периода

# health.alert.error_title
source: Health sync
ru: Синхронизация Health

# health.alert.success_title
source: Done
ru: Готово

# health.sync.recent_success
source: Recent workouts and today’s summary were uploaded.
ru: Недавние тренировки и сводка за сегодня загружены.

# health.history.success
source: Daily history export finished successfully.
ru: Выгрузка истории по дням успешно завершена.

# health.archive.success_message
source: Archive is ready to share.
ru: Архив готов к отправке.

# health.sync.success_generic
source: Health sync finished successfully.
ru: Синхронизация Health успешно завершена.

# health.sync.stage.history %lld
source: Exporting daily summaries (%lld days)…
ru: Экспорт дневных сводок (%lld дн.)…

# health.sync.stage.history_progress %lld %lld
source: Exporting daily summaries (%1$lld of %2$lld)…
ru: Экспорт дневных сводок (%1$lld из %2$lld)…

# health.sync.cancelled
source: Sync was cancelled.
ru: Синхронизация отменена.

# health.sync.stage.archive %lld
source: Building archive (%lld files)…
ru: Сборка архива (%lld файлов)…

# health.archive.include_workouts
source: Include all workouts
ru: Включить все тренировки

# health.archive.export_button
source: Create ZIP archive
ru: Создать ZIP-архив

# health.archive.building
source: Building archive…
ru: Сборка архива…

# health.archive.footer
source: Creates a local ZIP with HealthData/ layout. Share or save it without uploading.
ru: Создаёт локальный ZIP в формате HealthData/. Можно сохранить или отправить без загрузки на сервер.

# health.archive.empty
source: No data to export for the selected range.
ru: Нет данных для экспорта в выбранном периоде.

# health.error.invalid_date_range
source: Invalid date range.
ru: Некорректный диапазон дат.

# health.sync.last_daily
source: Last daily export
ru: Последний daily export

# health.settings.section
source: Health
ru: Здоровье

# health.settings.title
source: Health sync
ru: Синхронизация Health

# health.settings.enable
source: Enable Health tab
ru: Включить вкладку Health

# health.settings.enable_footer
source: When enabled, a Health tab appears with today’s summary and sync controls.
ru: Появится вкладка Health с краткой сводкой за сегодня и управлением синхронизацией.

# health.settings.folder_section
source: Vault folder
ru: Папка в vault

# health.settings.folder
source: Relative path
ru: Относительный путь

# health.settings.folder_footer
source: Stored on the server under your knowledge base (default HealthData/).
ru: Хранится на сервере в базе знаний (по умолчанию HealthData/).

# health.settings.available
source: Available
ru: Доступен

# health.settings.unavailable
source: Unavailable
ru: Недоступен

# common.save
source: Save
ru: Сохранить

# common.delete
source: Delete
ru: Удалить

# common.close
source: Close
ru: Закрыть

# common.done
source: Done
ru: Готово

# common.select
source: Select
ru: Выбрать

# common.create
source: Create
ru: Создать

# common.set
source: Set
ru: Установить

# common.refresh
source: Refresh
ru: Обновить

# common.pin
source: Pin
ru: Закрепить

# common.unpin
source: Unpin
ru: Открепить

# common.rename
source: Rename
ru: Переименовать

# common.session
source: Session
ru: Сессия

# common.expanded
source: Expanded
ru: Развёрнуто

# common.collapsed
source: Collapsed
ru: Свёрнуто

# voice.locked_recording
source: Locked recording
ru: Запись зафиксирована

# voice.recording_paused
source: Recording paused
ru: Запись на паузе

# voice.pause
source: Pause
ru: Пауза

# voice.resume
source: Resume
ru: Продолжить

# voice.send
source: Send
ru: Отправить

# voice.swipe_up_to_lock
source: Swipe up to lock
ru: Смахните вверх, чтобы зафиксировать

# voice.swipe_left_hint
source: Swipe left to cancel · Release to review
ru: Влево — отмена · Отпустите для проверки

# voice.record_a11y
source: Record voice
ru: Записать голос

# composer.message_placeholder
source: Message
ru: Сообщение

# composer.photos
source: Photos
ru: Фото

# composer.camera
source: Camera
ru: Камера

# composer.files
source: Files
ru: Файлы

# composer.add_attachment_a11y
source: Add attachment
ru: Добавить вложение

# composer.send_a11y
source: Send
ru: Отправить

# chat.changed_files_in_reply
source: Changed files in this reply
ru: Изменённые файлы в ответе

# chat.recent_changed_files
source: Recent changed files
ru: Недавние изменённые файлы

# chat.open_changed_files
source: Open changed files
ru: Открыть изменённые файлы

# chat.changed_files_a11y_hint
source: Shows or hides the changed files list
ru: Показать или скрыть список изменённых файлов

# chat.alert_title
source: Chat
ru: Чат

# chat.loading_messages
source: Loading messages…
ru: Загрузка сообщений…

# chat.typing_a11y
source: Assistant is typing
ru: Ассистент печатает

# settings.title
source: Settings
ru: Настройки

# settings.api_base_url
source: API base URL (https://…)
ru: Базовый URL API (https://…)

# settings.auth_token
source: Bearer token (dev only)
ru: Bearer-токен (только для разработки)

# settings.api_footer
source: Matches env vars KBAPP_API_BASE_URL and KBAPP_AUTH_TOKEN. The bearer token is stored in the Keychain when you tap Save.
ru: Соответствует переменным KBAPP_API_BASE_URL и KBAPP_AUTH_TOKEN. Токен сохраняется в Keychain после «Сохранить».

# settings.voice_routing
source: Voice routing
ru: Голосовой маршрут

# settings.voice_expires
source: Expires
ru: Истекает

# settings.voice_no_limit
source: No limit
ru: Без ограничения

# settings.clear_voice_default
source: Clear voice default
ru: Сбросить голосовой чат по умолчанию

# settings.voice_not_set
source: Not set — use “Default for voice” on a session in the list.
ru: Не задано — в списке сессий выберите «По умолчанию для голоса».

# settings.voice_footer
source: Used by Apple Watch and by “record” deep links that open a chat. Optional TTL resets automatically.
ru: Используется Apple Watch и deep link «record», который открывает чат. Необязательный TTL сбрасывается сам.

# settings.offline
source: Offline
ru: Офлайн

# settings.manage_offline_cache
source: Manage offline cache
ru: Управление офлайн-кэшем

# settings.offline_footer
source: Images and voice messages you open are saved locally for offline viewing.
ru: Открытые изображения и голосовые сохраняются локально для просмотра офлайн.

# settings.developer
source: Developer
ru: Разработка

# settings.debug_menu
source: Debug menu
ru: Меню отладки

# settings.developer_hint
source: Opens as a sheet (same window from Settings or a three-finger swipe down). Navigation inside Debug is kept until the app is killed. Shake-to-send logs lives under Debug → Logs → Settings.
ru: Открывается листом (из Настроек или свайпом вниз тремя пальцами). Навигация внутри Debug сохраняется до закрытия приложения. Отправка логов жестом — в Debug → Logs → Settings.

# main.title
source: Knowledge Base
ru: База знаний

# main.search_prompt
source: ID or message text
ru: ID или текст сообщения

# main.new_session
source: New session
ru: Новая сессия

# main.changed_files
source: Changed files
ru: Изменённые файлы

# main.loading_sessions
source: Loading sessions…
ru: Загрузка сессий…

# main.could_not_load
source: Could not load
ru: Не удалось загрузить

# main.no_matches
source: No matches
ru: Нет совпадений

# main.no_sessions
source: No sessions
ru: Нет сессий

# main.no_matches_hint
source: Try another query (session ID or text from messages).
ru: Попробуйте другой запрос (ID сессии или текст из сообщений).

# main.no_sessions_hint
source: Configure the API in Settings, or use a stub build with a demo session when no server is set.
ru: Настройте API в Настройках или используйте stub-сборку с демо-сессией без сервера.

# main.delete_session_title
source: Delete session?
ru: Удалить сессию?

# main.delete_session_message_format
source: “%@” will be removed from your list. This cannot be undone from the app.
ru: «%@» будет удалена из списка. Из приложения это нельзя отменить.

# main.session_alert
source: Session
ru: Сессия

# main.recording_alert
source: Recording
ru: Запись

# main.voice_default
source: Voice default
ru: Голос по умолчанию

# main.clear_default
source: Clear default
ru: Сбросить по умолчанию

# main.clear_voice_default
source: Clear voice default
ru: Сбросить голосовой чат по умолчанию

# main.set_voice_default
source: Set as voice default
ru: Сделать голосовым по умолчанию

# main.pinned_a11y
source: Pinned
ru: Закреплено

# main.default_for_voice_a11y
source: Default for voice
ru: По умолчанию для голоса

# main.messages_kb_format
source: %lld messages · %@
ru: %lld сообщ. · %@

# session.new_title
source: New session
ru: Новая сессия

# session.new_blank_hint
source: Leave blank to use “New session”.
ru: Оставьте пустым — будет «Новая сессия».

# session.use_kb
source: Use Knowledge Base
ru: Использовать базу знаний

# session.use_kb_footer
source: When enabled, the assistant can search your knowledge base. This applies to the whole session.
ru: Если включено, ассистент может искать по базе знаний. Действует на всю сессию.

# session.rename_title
source: Rename session
ru: Переименовать сессию

# session.rename_hint_format
source: Renaming “%@”.
ru: Переименование «%@».

# offline.cache_title
source: Offline cache
ru: Офлайн-кэш

# offline.cache_empty
source: No attachments cached yet. Open images or voice messages while online.
ru: Пока ничего не закэшировано. Откройте изображения или голосовые онлайн.

# offline.clear_all_cache
source: Clear all cache
ru: Очистить весь кэш

# offline.clear_all
source: Clear all
ru: Очистить всё

# offline.clear_confirm_format
source: This removes %lld files (%@). They will download again when opened online.
ru: Будет удалено файлов: %lld (%@). Они скачаются снова при открытии онлайн.

# files.changed_title
source: Changed files
ru: Изменённые файлы

# files.changed_empty
source: When the assistant updates files, they will appear here.
ru: Когда ассистент изменит файлы, они появятся здесь.

# voice.default_sheet_title
source: Voice default
ru: Голос по умолчанию

# voice.default_sheet_heading
source: Default voice session
ru: Сессия для голоса по умолчанию

# voice.default_sheet_body
source: Voice from the home screen, widget, or Watch will go to this session when no chat is open.
ru: Голос с главного экрана, виджета или Watch попадёт в эту сессию, если чат не открыт.

# session.kb_mode_on
source: Knowledge base
ru: База знаний

# session.kb_mode_off
source: Chat only
ru: Только чат

# session.title_field
source: Session title
ru: Название сессии

# session.duration
source: Duration
ru: Длительность

# common.loading
source: Loading…
ru: Загрузка…

# files.no_changes
source: No changes
ru: Нет изменений

# offline.attachments_cached
source: Attachments cached
ru: Вложений в кэше

# offline.total_size
source: Total size
ru: Общий размер

# offline.cached_files
source: Cached files
ru: Кэшированные файлы

# offline.clear_confirm_title
source: Clear all cached attachments?
ru: Очистить все кэшированные вложения?

# offline.opened_format
source: opened %@
ru: открыто %@

# offline.session_format
source: session %@
ru: сессия %@

# offline.preview
source: Preview
ru: Просмотр

# offline.delete
source: Delete
ru: Удалить

# offline.delete_selected
source: Delete selected
ru: Удалить выбранное

# attachment.video_fallback
source: Video
ru: Видео

# main.messages_count_format
source: %lld messages · %@
ru: %lld сообщ. · %@

# voice.ttl.thirty_minutes
source: 30 minutes
ru: 30 минут

# voice.ttl.one_hour
source: 1 hour
ru: 1 час

# voice.ttl.two_hours
source: 2 hours
ru: 2 часа

# voice.ttl.end_of_day
source: Until end of day
ru: До конца дня

# voice.ttl.indefinite
source: No limit
ru: Без ограничения

# voice.default_ended_title
source: Voice default ended
ru: Голос по умолчанию сброшен

# voice.temp_default_ended_title
source: Temporary default ended
ru: Временный голос по умолчанию сброшен

# voice.default_ended_subtitle
source: Recordings open the review sheet until you pick a new default session.
ru: Записи откроют экран проверки, пока не выберете новую сессию по умолчанию.

# voice.default_restored_subtitle_format
source: Voice routing is back on “%@”.
ru: Голосовой маршрут снова на «%@».

# common.dismiss
source: Dismiss
ru: Закрыть

# diff.title
source: Diff
ru: Дифф

source: Diff mode
ru: Режим диффа

# diff.mode.unified
source: Unified
ru: Объединённый

# diff.mode.split
source: Split
ru: Разделённый

# diff.old
source: Old
ru: Было

# diff.new
source: New
ru: Стало

# diff.content
source: Content
ru: Содержимое

# diff.before
source: Before
ru: До

# diff.after
source: After
ru: После

# diff.current
source: Current
ru: Текущая

# diff.open
source: Open
ru: Открыть

# diff.revert
source: Revert
ru: Откатить

# diff.revert_confirm
source: Revert this file to the previous version?
ru: Откатить файл к предыдущей версии?

# diff.current_version
source: Current version
ru: Текущая версия

# diff.show_more_unchanged_format
source: Show %lld more unchanged lines
ru: Показать ещё %lld неизменённых строк

# diff.no_textual_changes
source: No textual changes
ru: Нет текстовых изменений

# attach.title
source: Attach
ru: Вложение

# attach.gallery
source: Gallery
ru: Галерея

# attach.camera
source: Camera
ru: Камера

# attach.file
source: File
ru: Файл

# preview.title
source: Preview
ru: Просмотр

source: Preview unavailable
ru: Просмотр недоступен

# table.title
source: Table
ru: Таблица

# table.rotate
source: Rotate
ru: Повернуть

# attachment.fallback_name
source: Attachment
ru: Вложение

# attachment.no_preview_url
source: This attachment has no preview URL.
ru: У вложения нет URL для просмотра.

# attachment.download_failed
source: Could not download the attachment.
ru: Не удалось скачать вложение.

# debug.title
source: Debug
ru: Отладка

# debug.send_logs_title
source: Send debug logs?
ru: Отправить отладочные логи?
